<a href="https://colab.research.google.com/github/raviyadav44/Different_EDA_techiniques/blob/main/Untitled23.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###Ordinal Number Encoding

####Example:Grading system,no of Experience

A-1,B-2,C-3,D-4 etc.

WEEK DAYS-sunday-1,saturday-2
<br>
satisfied,neutral,unsatisfied

In [17]:
import datetime

In [18]:
today_date=datetime.datetime.today()

In [19]:
today_date

datetime.datetime(2021, 6, 8, 6, 38, 4, 749875)

In [20]:
today_date-datetime.timedelta(3)

datetime.datetime(2021, 6, 5, 6, 38, 4, 749875)

In [21]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [22]:
 import pandas as pd
 data=pd.DataFrame(days)
 data.columns=['Day']

In [23]:
data.head()

                         Day
0 2021-06-08 06:38:04.749875
1 2021-06-07 06:38:04.749875
2 2021-06-06 06:38:04.749875
3 2021-06-05 06:38:04.749875
4 2021-06-04 06:38:04.749875

In [24]:
data['Week_days']=data['Day'].dt.day_name()
data.head()

                         Day Week_days
0 2021-06-08 06:38:04.749875   Tuesday
1 2021-06-07 06:38:04.749875    Monday
2 2021-06-06 06:38:04.749875    Sunday
3 2021-06-05 06:38:04.749875  Saturday
4 2021-06-04 06:38:04.749875    Friday

In [25]:
data['Day'].dt.day

0      8
1      7
2      6
3      5
4      4
5      3
6      2
7      1
8     31
9     30
10    29
11    28
12    27
13    26
14    25
Name: Day, dtype: int64

In [26]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
            }

In [27]:
dictionary

{'Friday': 5,
 'Monday': 1,
 'Saturday': 6,
 'Sunday': 7,
 'Thursday': 4,
 'Tuesday': 2,
 'Wednesday': 3}

In [28]:
data['Week_days_ordinal']=data['Week_days'].map(dictionary)

In [29]:
data.head()

                         Day Week_days  Week_days_ordinal
0 2021-06-08 06:38:04.749875   Tuesday                  2
1 2021-06-07 06:38:04.749875    Monday                  1
2 2021-06-06 06:38:04.749875    Sunday                  7
3 2021-06-05 06:38:04.749875  Saturday                  6
4 2021-06-04 06:38:04.749875    Friday                  5

###Count or frequency Encoding

In [34]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None) 
train_set.head()

   0                  1       2           3   ...  11  12              13      14
0  39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
2  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
3  53            Private  234721        11th  ...   0  40   United-States   <=50K
4  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K

[5 rows x 15 columns]

In [36]:
len(train_set[1].unique())

9

In [37]:
columns=[1,3,5,6,7,8,9,13]

In [39]:
train_set[columns].head()

                  1           3   ...       9               13
0          State-gov   Bachelors  ...     Male   United-States
1   Self-emp-not-inc   Bachelors  ...     Male   United-States
2            Private     HS-grad  ...     Male   United-States
3            Private        11th  ...     Male   United-States
4            Private   Bachelors  ...   Female            Cuba

[5 rows x 8 columns]

In [40]:
train_set=train_set[columns]

In [43]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [44]:
train_set.head()

          Employment      Degree  ...      Sex         Country
0          State-gov   Bachelors  ...     Male   United-States
1   Self-emp-not-inc   Bachelors  ...     Male   United-States
2            Private     HS-grad  ...     Male   United-States
3            Private        11th  ...     Male   United-States
4            Private   Bachelors  ...   Female            Cuba

[5 rows x 8 columns]

In [45]:
for feature in train_set.columns[:]:
  print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [48]:
country_map=train_set['Country'].value_counts().to_dict()

In [49]:
train_set['Country']=train_set['Country'].map(country_map)

In [50]:
train_set.head()

          Employment      Degree               Status  ...    Race      Sex Country
0          State-gov   Bachelors        Never-married  ...   White     Male   29170
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   29170
2            Private     HS-grad             Divorced  ...   White     Male   29170
3            Private        11th   Married-civ-spouse  ...   Black     Male   29170
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female      95

[5 rows x 8 columns]

##Advantages

1. Easy to use
2. Not increasing feature space

##Disadvantage

1. It will provide same weight if the frequencies are same

#Target guided Ordinal encoding

1. Ordering the label according to the target
2. Replace the labes by the joit probabiity of bieng 1 or 0

In [52]:
df=pd.read_csv("/content/drive/MyDrive/titanic/titanic.csv",usecols=['cabin','survived'])
df.head()

   survived cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [54]:
 df['cabin'].fillna('missing',inplace=True)

In [55]:
df.head()

   survived    cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing

In [56]:
df['cabin'].astype(str).str[0]

0      m
1      C
2      m
3      C
4      m
      ..
886    m
887    B
888    m
889    C
890    m
Name: cabin, Length: 891, dtype: object

In [57]:
df['cabin']=df['cabin'].astype(str).str[0]

In [58]:
df.head()

   survived cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [59]:
df['cabin'].unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [60]:
df.groupby(['cabin'])['survived'].mean()

cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: survived, dtype: float64

In [62]:
df.groupby(['cabin'])['survived'].mean().sort_values().index

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='cabin')

In [63]:
ordinal_labels=df.groupby(['cabin'])['survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='cabin')

In [64]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'T': 0, 'm': 1}

In [65]:
df['cabin_ordinal_labels']=df['cabin'].map(ordinal_labels2)
df.head()

   survived cabin  cabin_ordinal_labels
0         0     m                     1
1         1     C                     4
2         1     m                     1
3         1     C                     4
4         0     m                     1

#Mean Encoding

In [68]:
mean_ordinal=df.groupby(['cabin'])['survived'].mean().to_dict()

In [69]:
df['cabin_ordinal_mean']=df['cabin'].map(mean_ordinal)

In [70]:
df.head()

   survived cabin  cabin_ordinal_labels  cabin_ordinal_mean
0         0     m                     1            0.299854
1         1     C                     4            0.593220
2         1     m                     1            0.299854
3         1     C                     4            0.593220
4         0     m                     1            0.299854

#Advantage

1. capture information within the label therfore rendering more predictive features

2. creat a monotonic relationship between variable and the target

#Disadvantage

1. leads to over fitting.